requests/installconfig.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:r20="http://r200806.ws.fmg.fortinet.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <r20:execSecurityconsoleInstallPackage>
         <data>
            <adom>{{ adom }}</adom>
            <pkg>tcecluster</pkg>
            <flags>ifpolicy_only</flags>
            {% if revisao %}
               <flags>generate_rev</flags>
               <adom_rev_name>{{ rev_nome }}</adom_rev_name>
               <adom_rev_comments>{{ rev_comentario }}</adom_rev_comments>
            {% endif %}
         </data>
         <session>{{ sessao }}</session>
      </r20:execSecurityconsoleInstallPackage>
   </soapenv:Body>
</soapenv:Envelope>